# Рекурсия!
"""
1) def test(x):
    if x < 4:
        print(x)
        test(x+1)
        print(x)
print(test(1))
2) def fact(x):
    if x == 1:
        return 1
    return fact(x-1)*x
print(fact(5))
3) def feb(x):
    if x == 1:
        return 0
    if x == 2:
        return 1
    return feb(x-1) + feb(x-2)

Рекурсивная функция — это функция, которая содержит код вызова самой себя с целью организации циклического процесса.
С помощью рекурсивных функций можно с минимальным объемом кода решать некоторые задачи,
обойдя использование (объявление) лишних структур данных



 """

